XMLSamples/1P_Air_Vehicle_Hotel/Air Fuzzy Search-PASS.txt

Air Fuzzy Search-Request
******************************************************************** 
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
   <soap:Body>
      <LowFareSearchReq TargetBranch="TP_1P_SOA" TraceId="PP_1P_001" PreferCompleteItinerary="false" SolutionResult="true" xmlns="http://www.travelport.com/schema/air_v50_0">
         <BillingPointOfSaleInfo OriginApplication="UAPI" xmlns="http://www.travelport.com/schema/common_v50_0"/>
         <SearchAirLeg>
            <SearchOrigin>
               <CityOrAirport Code="DEN" PreferCity="true" xmlns="http://www.travelport.com/schema/common_v50_0"/>
            </SearchOrigin>
            <SearchDestination>
               <CityOrAirport Code="SFO" PreferCity="true" xmlns="http://www.travelport.com/schema/common_v50_0"/>
            </SearchDestination>
            <SearchDepTime PreferredTime="2020-05-31">
               <SearchExtraDays DaysBefore="2" DaysAfter="2" xmlns="http://www.travelport.com/schema/common_v50_0"/>
            </SearchDepTime>
         </SearchAirLeg>
         <AirSearchModifiers>
            <PreferredProviders>
               <Provider Code="1P" xmlns="http://www.travelport.com/schema/common_v50_0"/>
            </PreferredProviders>
         </AirSearchModifiers>
         <SearchPassenger Code="ADT" xmlns="http://www.travelport.com/schema/common_v50_0"/>
         <!--<FlexExploreModifiers Type="Destination">
            <Destination>SEA</Destination>
            <Destination>PDX</Destination>
            <Destination>LAX</Destination>
            <Destination>SDG</Destination>
         </FlexExploreModifiers>-->
      </LowFareSearchReq>
   </soap:Body>
</soap:Envelope>

Air Fuzzy Search-Response
******************************************************************** 
<SOAP:Envelope xmlns:SOAP="http://schemas.xmlsoap.org/soap/envelope/">
   <SOAP:Body>
      <air:LowFareSearchRsp TraceId="PP_1P_001" TransactionId="9DCD58B20A0764785B1483FC14855109" ResponseTime="4686" DistanceUnits="MI" CurrencyType="USD" xmlns:air="http://www.travelport.com/schema/air_v50_0" xmlns:common_v50_0="http://www.travelport.com/schema/common_v50_0">
         <air:FlightDetailsList>
            <air:FlightDetails Key="xs/MMC4R2BKAbDOKCAAAAA==" Origin="DEN" Destination="SFO" DepartureTime="2020-05-29T15:56:00.000-06:00" ArrivalTime="2020-05-29T17:45:00.000-07:00" FlightTime="169" TravelTime="169" Distance="964" Equipment="321" DestinationTerminal="I"/>
            <air:FlightDetails Key="xs/MMC4R2BKAmDOKCAAAAA==" Origin="DEN" Destination="SFO" DepartureTime="2020-06-02T06:30:00.000-06:00" ArrivalTime="2020-06-02T08:24:00.000-07:00" FlightTime="174" TravelTime="174" Distance="964" Equipment="320" DestinationTerminal="I"/>
            <air:FlightDetails Key="xs/MMC4R2BKAwDOKCAAAAA==" Origin="DEN" Destination="SFO" DepartureTime="2020-05-30T06:00:00.000-06:00" ArrivalTime="2020-05-30T07:54:00.000-07:00" FlightTime="174" TravelTime="174" Distance="964" Equipment="320" DestinationTerminal="I"/>
            <air:FlightDetails Key="xs/MMC4R2BKA6DOKCAAAAA==" Origin="DEN" Destination="SLC" DepartureTime="2020-05-31T14:55:00.000-06:00" ArrivalTime="2020-05-31T16:29:00.000-06:00" FlightTime="94" TravelTime="94" Distance="390" Equipment="738" OnTimePerformance="90" DestinationTerminal="2"/>
            <air:FlightDetails Key="xs/MMC4R2BKA8DOKCAAAAA==" Origin="SLC" Destination="SJC" DepartureTime="2020-05-31T17:10:00.000-06:00" ArrivalTime="2020-05-31T18:05:00.000-07:00" FlightTime="115" TravelTime="156" Distance="583" Equipment="221" OnTimePerformance="90" OriginTerminal="2" DestinationTerminal="A"/>
            <air:FlightDetails Key="xs/MMC4R2BKAHEOKCAAAAA==" Origin="DEN" Destination="SFO" DepartureTime="2020-06-01T07:55:00.000-06:00" ArrivalTime="2020-06-01T09:40:00.000-07:00" FlightTime="165" TravelTime="165" Distance="964" Equipment="788" OnTimePerformance="80" DestinationTerminal="3"/>
         </air:FlightDetailsList>
         <air:AirSegmentList>
            <air:AirSegment Key="xs/MMC4R2BKAaDOKCAAAAA==" Group="0" Carrier="F9" FlightNumber="665" Origin="DEN" Destination="SFO" DepartureTime="2020-05-29T15:56:00.000-06:00" ArrivalTime="2020-05-29T17:45:00.000-07:00" FlightTime="169" Distance="964" ETicketability="Yes" Equipment="321" ChangeOfPlane="false" ParticipantLevel="Normal" OptionalServicesIndicator="false" AvailabilitySource="P">
               <air:AirAvailInfo ProviderCode="1P"/>
               <air:FlightDetailsRef Key="xs/MMC4R2BKAbDOKCAAAAA=="/>
            </air:AirSegment>
            <air:AirSegment Key="xs/MMC4R2BKAlDOKCAAAAA==" Group="0" Carrier="F9" FlightNumber="663" Origin="DEN" Destination="SFO" DepartureTime="2020-06-02T06:30:00.000-06:00" ArrivalTime="2020-06-02T08:24:00.000-07:00" FlightTime="174" Distance="964" ETicketability="Yes" Equipment="320" ChangeOfPlane="false" ParticipantLevel="Normal" OptionalServicesIndicator="false" AvailabilitySource="P">
               <air:AirAvailInfo ProviderCode="1P"/>
               <air:FlightDetailsRef Key="xs/MMC4R2BKAmDOKCAAAAA=="/>
            </air:AirSegment>
            <air:AirSegment Key="xs/MMC4R2BKAvDOKCAAAAA==" Group="0" Carrier="F9" FlightNumber="663" Origin="DEN" Destination="SFO" DepartureTime="2020-05-30T06:00:00.000-06:00" ArrivalTime="2020-05-30T07:54:00.000-07:00" FlightTime="174" Distance="964" ETicketability="Yes" Equipment="320" ChangeOfPlane="false" ParticipantLevel="Normal" OptionalServicesIndicator="false" AvailabilitySource="P">
               <air:AirAvailInfo ProviderCode="1P"/>
               <air:FlightDetailsRef Key="xs/MMC4R2BKAwDOKCAAAAA=="/>
            </air:AirSegment>
            <air:AirSegment Key="xs/MMC4R2BKA5DOKCAAAAA==" Group="0" Carrier="DL" FlightNumber="1165" Origin="DEN" Destination="SLC" DepartureTime="2020-05-31T14:55:00.000-06:00" ArrivalTime="2020-05-31T16:29:00.000-06:00" FlightTime="94" Distance="390" ETicketability="Yes" Equipment="738" ChangeOfPlane="false" ParticipantLevel="Airline Source" OptionalServicesIndicator="false" AvailabilitySource="A">
               <air:AirAvailInfo ProviderCode="1P"/>
               <air:FlightDetailsRef Key="xs/MMC4R2BKA6DOKCAAAAA=="/>
            </air:AirSegment>
            <air:AirSegment Key="xs/MMC4R2BKA7DOKCAAAAA==" Group="0" Carrier="DL" FlightNumber="1659" Origin="SLC" Destination="SJC" DepartureTime="2020-05-31T17:10:00.000-06:00" ArrivalTime="2020-05-31T18:05:00.000-07:00" FlightTime="115" Distance="583" ETicketability="Yes" Equipment="221" ChangeOfPlane="false" ParticipantLevel="Airline Source" OptionalServicesIndicator="false" AvailabilitySource="A">
               <air:AirAvailInfo ProviderCode="1P"/>
               <air:FlightDetailsRef Key="xs/MMC4R2BKA8DOKCAAAAA=="/>
            </air:AirSegment>
            <air:AirSegment Key="xs/MMC4R2BKAGEOKCAAAAA==" Group="0" Carrier="UA" FlightNumber="419" Origin="DEN" Destination="SFO" DepartureTime="2020-06-01T07:55:00.000-06:00" ArrivalTime="2020-06-01T09:40:00.000-07:00" FlightTime="165" Distance="964" ETicketability="Yes" Equipment="788" ChangeOfPlane="false" ParticipantLevel="Airline Source" OptionalServicesIndicator="false" AvailabilitySource="A">
               <air:AirAvailInfo ProviderCode="1P"/>
               <air:FlightDetailsRef Key="xs/MMC4R2BKAHEOKCAAAAA=="/>
            </air:AirSegment>
         </air:AirSegmentList>
         <air:FareInfoList>
            <air:FareInfo Key="xs/MMC4R2BKAiDOKCAAAAA==" FareBasis="R07PXS5" PassengerTypeCode="ADT" Origin="DEN" Destination="SFO" EffectiveDate="2020-03-02T19:30:50.000-05:00" DepartureDate="2020-05-29">
               <air:FareRuleKey FareInfoRef="xs/MMC4R2BKAiDOKCAAAAA==" ProviderCode="1P">dir-DEN^SFO^2020150^ALL^R07PXS5^F9^^</air:FareRuleKey>
            </air:FareInfo>
            <air:FareInfo Key="xs/MMC4R2BKAsDOKCAAAAA==" FareBasis="R07PXS5" PassengerTypeCode="ADT" Origin="DEN" Destination="SFO" EffectiveDate="2020-03-02T19:30:50.000-05:00" DepartureDate="2020-06-02">
               <air:FareRuleKey FareInfoRef="xs/MMC4R2BKAsDOKCAAAAA==" ProviderCode="1P">dir-DEN^SFO^2020154^ALL^R07PXS5^F9^^</air:FareRuleKey>
            </air:FareInfo>
            <air:FareInfo Key="xs/MMC4R2BKA2DOKCAAAAA==" FareBasis="W07ANITE" PassengerTypeCode="ADT" Origin="DEN" Destination="SFO" EffectiveDate="2020-03-02T19:30:50.000-05:00" DepartureDate="2020-05-30">
               <air:FareRuleKey FareInfoRef="xs/MMC4R2BKA2DOKCAAAAA==" ProviderCode="1P">dir-DEN^SFO^2020151^ALL^W07ANITE^F9^^</air:FareRuleKey>
            </air:FareInfo>
            <air:FareInfo Key="xs/MMC4R2BKACEOKCAAAAA==" FareBasis="VAVNQ3BG" PassengerTypeCode="ADT" Origin="DEN" Destination="SJC" EffectiveDate="2020-03-02T19:30:50.000-05:00" DepartureDate="2020-05-31">
               <air:FareRuleKey FareInfoRef="xs/MMC4R2BKACEOKCAAAAA==" ProviderCode="1P">dir-DEN^SJC^2020152^ALL^VAVNQ3BG^DL^^</air:FareRuleKey>
            </air:FareInfo>
            <air:FareInfo Key="xs/MMC4R2BKANEOKCAAAAA==" FareBasis="KAA7TCBN" PassengerTypeCode="ADT" Origin="DEN" Destination="SFO" EffectiveDate="2020-03-02T19:30:50.000-05:00" DepartureDate="2020-06-01">
               <air:FareRuleKey FareInfoRef="xs/MMC4R2BKANEOKCAAAAA==" ProviderCode="1P">dir-DEN^SFO^2020153^ALL^KAA7TCBN^UA^^</air:FareRuleKey>
            </air:FareInfo>
         </air:FareInfoList>
         <air:RouteList>
            <air:Route Key="xs/MMC4R2BKAPEOKCAAAAA==">
               <air:Leg Key="xs/MMC4R2BKAcDOKCAAAAA==" Group="0" Origin="DEN" Destination="SFO"/>
            </air:Route>
         </air:RouteList>
         <air:AirPricingSolution Key="xs/MMC4R2BKAZDOKCAAAAA==" TotalPrice="USD48.40" BasePrice="USD31.62" ApproximateTotalPrice="USD48.40" ApproximateBasePrice="USD31.62" Taxes="USD16.78" ApproximateTaxes="USD16.78">
            <air:Journey TravelTime="P0DT2H49M0S">
               <air:AirSegmentRef Key="xs/MMC4R2BKAaDOKCAAAAA=="/>
            </air:Journey>
            <air:LegRef Key="xs/MMC4R2BKAcDOKCAAAAA=="/>
            <air:AirPricingInfo Key="xs/MMC4R2BKAdDOKCAAAAA==" TotalPrice="USD48.40" BasePrice="USD31.62" ApproximateTotalPrice="USD48.40" ApproximateBasePrice="USD31.62" Taxes="USD16.78" ApproximateTaxes="USD16.78" LatestTicketingTime="2020-03-02" PricingMethod="Auto" ETicketability="Yes" PlatingCarrier="F9" ProviderCode="1P">
               <air:FareInfoRef Key="xs/MMC4R2BKAiDOKCAAAAA=="/>
               <air:BookingInfo BookingCode="R" BookingCount="9" CabinClass="Economy" FareInfoRef="xs/MMC4R2BKAiDOKCAAAAA==" SegmentRef="xs/MMC4R2BKAaDOKCAAAAA=="/>
               <air:TaxInfo Category="AY" Amount="USD5.60" Key="xs/MMC4R2BKAeDOKCAAAAAAA"/>
               <air:TaxInfo Category="US" Amount="USD2.38" Key="xs/MMC4R2BKAfDOKCAAAAAAA"/>
               <air:TaxInfo Category="XF" Amount="USD4.50" Key="xs/MMC4R2BKAgDOKCAAAAAAA">
                  <common_v50_0:TaxDetail Amount="USD4.50" OriginAirport="DEN"/>
               </air:TaxInfo>
               <air:TaxInfo Category="ZP" Amount="USD4.30" Key="xs/MMC4R2BKAhDOKCAAAAAAA">
                  <common_v50_0:TaxDetail Amount="USD4.30" OriginAirport="DEN"/>
               </air:TaxInfo>
               <air:PassengerType Code="ADT"/>
            </air:AirPricingInfo>
         </air:AirPricingSolution>
         <air:AirPricingSolution Key="xs/MMC4R2BKAkDOKCAAAAA==" TotalPrice="USD48.40" BasePrice="USD31.62" ApproximateTotalPrice="USD48.40" ApproximateBasePrice="USD31.62" Taxes="USD16.78" ApproximateTaxes="USD16.78">
            <air:Journey TravelTime="P0DT2H54M0S">
               <air:AirSegmentRef Key="xs/MMC4R2BKAlDOKCAAAAA=="/>
            </air:Journey>
            <air:LegRef Key="xs/MMC4R2BKAcDOKCAAAAA=="/>
            <air:AirPricingInfo Key="xs/MMC4R2BKAnDOKCAAAAA==" TotalPrice="USD48.40" BasePrice="USD31.62" ApproximateTotalPrice="USD48.40" ApproximateBasePrice="USD31.62" Taxes="USD16.78" ApproximateTaxes="USD16.78" LatestTicketingTime="2020-03-02" PricingMethod="Auto" ETicketability="Yes" PlatingCarrier="F9" ProviderCode="1P">
               <air:FareInfoRef Key="xs/MMC4R2BKAsDOKCAAAAA=="/>
               <air:BookingInfo BookingCode="R" BookingCount="9" CabinClass="Economy" FareInfoRef="xs/MMC4R2BKAsDOKCAAAAA==" SegmentRef="xs/MMC4R2BKAlDOKCAAAAA=="/>
               <air:TaxInfo Category="AY" Amount="USD5.60" Key="xs/MMC4R2BKAoDOKCAAAAAAA"/>
               <air:TaxInfo Category="US" Amount="USD2.38" Key="xs/MMC4R2BKApDOKCAAAAAAA"/>
               <air:TaxInfo Category="XF" Amount="USD4.50" Key="xs/MMC4R2BKAqDOKCAAAAAAA">
                  <common_v50_0:TaxDetail Amount="USD4.50" OriginAirport="DEN"/>
               </air:TaxInfo>
               <air:TaxInfo Category="ZP" Amount="USD4.30" Key="xs/MMC4R2BKArDOKCAAAAAAA">
                  <common_v50_0:TaxDetail Amount="USD4.30" OriginAirport="DEN"/>
               </air:TaxInfo>
               <air:PassengerType Code="ADT"/>
            </air:AirPricingInfo>
         </air:AirPricingSolution>
         <air:AirPricingSolution Key="xs/MMC4R2BKAuDOKCAAAAA==" TotalPrice="USD65.40" BasePrice="USD47.44" ApproximateTotalPrice="USD65.40" ApproximateBasePrice="USD47.44" Taxes="USD17.96" ApproximateTaxes="USD17.96">
            <air:Journey TravelTime="P0DT2H54M0S">
               <air:AirSegmentRef Key="xs/MMC4R2BKAvDOKCAAAAA=="/>
            </air:Journey>
            <air:LegRef Key="xs/MMC4R2BKAcDOKCAAAAA=="/>
            <air:AirPricingInfo Key="xs/MMC4R2BKAxDOKCAAAAA==" TotalPrice="USD65.40" BasePrice="USD47.44" ApproximateTotalPrice="USD65.40" ApproximateBasePrice="USD47.44" Taxes="USD17.96" ApproximateTaxes="USD17.96" LatestTicketingTime="2020-03-02" PricingMethod="Auto" ETicketability="Yes" PlatingCarrier="F9" ProviderCode="1P">
               <air:FareInfoRef Key="xs/MMC4R2BKA2DOKCAAAAA=="/>
               <air:BookingInfo BookingCode="W" BookingCount="9" CabinClass="Economy" FareInfoRef="xs/MMC4R2BKA2DOKCAAAAA==" SegmentRef="xs/MMC4R2BKAvDOKCAAAAA=="/>
               <air:TaxInfo Category="AY" Amount="USD5.60" Key="xs/MMC4R2BKAyDOKCAAAAAAA"/>
               <air:TaxInfo Category="US" Amount="USD3.56" Key="xs/MMC4R2BKAzDOKCAAAAAAA"/>
               <air:TaxInfo Category="XF" Amount="USD4.50" Key="xs/MMC4R2BKA0DOKCAAAAAAA">
                  <common_v50_0:TaxDetail Amount="USD4.50" OriginAirport="DEN"/>
               </air:TaxInfo>
               <air:TaxInfo Category="ZP" Amount="USD4.30" Key="xs/MMC4R2BKA1DOKCAAAAAAA">
                  <common_v50_0:TaxDetail Amount="USD4.30" OriginAirport="DEN"/>
               </air:TaxInfo>
               <air:PassengerType Code="ADT"/>
            </air:AirPricingInfo>
         </air:AirPricingSolution>
         <air:AirPricingSolution Key="xs/MMC4R2BKA4DOKCAAAAA==" TotalPrice="USD89.20" BasePrice="USD61.40" ApproximateTotalPrice="USD89.20" ApproximateBasePrice="USD61.40" Taxes="USD27.80" ApproximateTaxes="USD27.80">
            <air:Journey TravelTime="P0DT4H10M0S">
               <air:AirSegmentRef Key="xs/MMC4R2BKA5DOKCAAAAA=="/>
               <air:AirSegmentRef Key="xs/MMC4R2BKA7DOKCAAAAA=="/>
            </air:Journey>
            <air:LegRef Key="xs/MMC4R2BKAcDOKCAAAAA=="/>
            <air:AirPricingInfo Key="xs/MMC4R2BKA9DOKCAAAAA==" TotalPrice="USD89.20" BasePrice="USD61.40" ApproximateTotalPrice="USD89.20" ApproximateBasePrice="USD61.40" Taxes="USD27.80" ApproximateTaxes="USD27.80" LatestTicketingTime="2020-03-03" PricingMethod="Auto" ETicketability="Yes" PlatingCarrier="DL" ProviderCode="1P">
               <air:FareInfoRef Key="xs/MMC4R2BKACEOKCAAAAA=="/>
               <air:BookingInfo BookingCode="E" BookingCount="4" CabinClass="Economy" FareInfoRef="xs/MMC4R2BKACEOKCAAAAA==" SegmentRef="xs/MMC4R2BKA5DOKCAAAAA=="/>
               <air:BookingInfo BookingCode="E" BookingCount="4" CabinClass="Economy" FareInfoRef="xs/MMC4R2BKACEOKCAAAAA==" SegmentRef="xs/MMC4R2BKA7DOKCAAAAA=="/>
               <air:TaxInfo Category="AY" Amount="USD5.60" Key="xs/MMC4R2BKA-DOKCAAAAAAA"/>
               <air:TaxInfo Category="US" Amount="USD4.60" Key="xs/MMC4R2BKA/DOKCAAAAAAA"/>
               <air:TaxInfo Category="XF" Amount="USD9.00" Key="xs/MMC4R2BKAAEOKCAAAAAAA">
                  <common_v50_0:TaxDetail Amount="USD4.50" OriginAirport="DEN"/>
                  <common_v50_0:TaxDetail Amount="USD4.50" OriginAirport="SLC"/>
               </air:TaxInfo>
               <air:TaxInfo Category="ZP" Amount="USD8.60" Key="xs/MMC4R2BKABEOKCAAAAAAA">
                  <common_v50_0:TaxDetail Amount="USD4.30" OriginAirport="DEN"/>
                  <common_v50_0:TaxDetail Amount="USD4.30" OriginAirport="SLC"/>
               </air:TaxInfo>
               <air:PassengerType Code="ADT"/>
            </air:AirPricingInfo>
            <air:Connection SegmentIndex="0"/>
         </air:AirPricingSolution>
         <air:AirPricingSolution Key="xs/MMC4R2BKAFEOKCAAAAA==" TotalPrice="USD97.40" BasePrice="USD77.21" ApproximateTotalPrice="USD97.40" ApproximateBasePrice="USD77.21" Taxes="USD20.19" ApproximateTaxes="USD20.19">
            <air:Journey TravelTime="P0DT2H45M0S">
               <air:AirSegmentRef Key="xs/MMC4R2BKAGEOKCAAAAA=="/>
            </air:Journey>
            <air:LegRef Key="xs/MMC4R2BKAcDOKCAAAAA=="/>
            <air:AirPricingInfo Key="xs/MMC4R2BKAIEOKCAAAAA==" TotalPrice="USD97.40" BasePrice="USD77.21" ApproximateTotalPrice="USD97.40" ApproximateBasePrice="USD77.21" Taxes="USD20.19" ApproximateTaxes="USD20.19" LatestTicketingTime="2020-03-03" PricingMethod="Auto" ETicketability="Yes" PlatingCarrier="UA" ProviderCode="1P">
               <air:FareInfoRef Key="xs/MMC4R2BKANEOKCAAAAA=="/>
               <air:BookingInfo BookingCode="N" BookingCount="4" CabinClass="Economy" FareInfoRef="xs/MMC4R2BKANEOKCAAAAA==" SegmentRef="xs/MMC4R2BKAGEOKCAAAAA=="/>
               <air:TaxInfo Category="AY" Amount="USD5.60" Key="xs/MMC4R2BKAJEOKCAAAAAAA"/>
               <air:TaxInfo Category="US" Amount="USD5.79" Key="xs/MMC4R2BKAKEOKCAAAAAAA"/>
               <air:TaxInfo Category="XF" Amount="USD4.50" Key="xs/MMC4R2BKALEOKCAAAAAAA">
                  <common_v50_0:TaxDetail Amount="USD4.50" OriginAirport="DEN"/>
               </air:TaxInfo>
               <air:TaxInfo Category="ZP" Amount="USD4.30" Key="xs/MMC4R2BKAMEOKCAAAAAAA">
                  <common_v50_0:TaxDetail Amount="USD4.30" OriginAirport="DEN"/>
               </air:TaxInfo>
               <air:PassengerType Code="ADT"/>
            </air:AirPricingInfo>
         </air:AirPricingSolution>
      </air:LowFareSearchRsp>
   </SOAP:Body>
</SOAP:Envelope>